{
  "temple": [
    {
    "name": "Snowflake Arizona Temple",
	"imgPath" : "https://parkinson-kristen.github.io/assignments/finalProject/images/Snowflake-temple1.jpg",
    "address": ["1875 W. Canyon Dr",
	"Snowlake, AZ 85937-6014",
		"United States"],
	"telephone": "1-928-536-6626",
	"email": "really@youvegottobekiddingme.org",
	"services": ["No clothing rental available",
		"No cafeteria available",
		"No patron housing available",
		"Distribution center nearby ",
		"Endowment sessions available in English, Spanish and Navajo"],
	
	"templeHistory": ["The site for the Snowflake Arizona Temple is situated on the west end of ",
		"town on top of a bluff scattered with cedar trees that has become known as 'Temple Hill.' ",
		"Unlike many other recently constructed temples, the temple does not share property with a ",
		"stake center or Church meetinghouse but is adjacent to a golf course. Approximately 8 feet ",
		"was removed from the top of the knoll to accommodate the two-level temple, patterned after ",
		"the Winter Quarters Nebraska Temple, with the lower level partially set into the knoll. The ",
		"temple district includes Arizona stakes in Snowflake, Taylor, Eagar, St. Johns, Pinetop/Lakeside,",
		"Show Low, Flagstaff, Tuba City, Holbrook, Winslow, and Chinle.",

		"Temple landscaping and plantlife complement the natural surroundings. In front of the temple's",
		"entry canopy is a beautiful water feature. Interior treatments reflect the history and culture of",
		"the area. Much of the furniture, for example, has a pioneer appearance similar to that of the ",
		"Vernal Utah Temple. Several pieces were custom built including some that have Native American",
		"designs carved into them. Native American patterns appear as painted stencil work on walls and ",
		"sculpted into the carpet. A console cabinet featuring a peach tree branch design on the doors is ",
		"on display. Jacob Hamblin, an early pioneer and missionary, traded goods with Native Americans ",
		"for peach pits which he planted to grow peach trees. A print depicting Jacob Hamblin meeting ",
		"with Native Americans on horseback hangs in the temple. A second console cabinet placed in front ",
		"of art glass windows features a gold-leaf sunburst on each of the three panels. Art glass windows ",
		"are like those used in the Hong Kong China Temple featuring beveled cuts that create a shimmer ",
		"of light outside the rooms of the temple. An exquisite set of stained-glass windows depicting ",
		"Christ instructing a circle of children and adults is on display in the temple interior. Dark ",
		"cherry wood and painted, light toned wood has been incorporated throughout the building ",
		"(Snowflake Arizona Temple Times Vol. II, pp. 1–2).",

		"At the groundbreaking ceremony, President Stephen Reidhead of the Snowflake Arizona Stake ",
		"related the history of the early pioneers who settled the area, dreaming that a temple would ",
		"be built there one day. In fulfillment of years of fasting and prayers, those dreams began their ",
		"culmination at the temple's groundbreaking. Elder Rex D. Pinegar of the Seventy, who presided at ",
		"the ceremony, said the temple was the most sacred place on earth. He encouraged members to ",
		"dissolve any feelings that drew them apart and to gather in the temple where no differences ",
		"exist. President Norris Baldwin of the Taylor Arizona Stake exhorted members toward worthiness ",
		"to attend the temple. The gospel of Jesus Christ, he said, leads to brotherhood and sisterhood. ",
		"'If you want to love God you must love other people' (30 September 2000, Church News)."

	],
	
	"templeFacts" : [ "The Snowflake Arizona Temple was the second temple built in Arizona, following ",
		"the Mesa Arizona Temple (1927).",

		"The Snowflake Arizona Temple is a sister building to the Winter Quarters Nebraska Temple.",

		"The town of Snowflake was named after its founder, William J. Flake, and the apostle with ",
		"charge over the Mormon colonization of Arizona, Erastus Snow, who visited the settlement a ",
		"few months after Flake arrived.",

		"In March 2017, the angel Moroni statue atop the Snowflake Arizona Temple was replaced. The ",
		"original statue faced east, looking over the rear side of the building. The new statue was ",
		"installed facing west, looking over the temple entrance."
	],
	
    "yearAnnounced": "April 2, 2000",
    "groundbreaking": "September 23, 2000",
	"dedicated": "March 3, 2002",
	
	"endowments": "",
	
	"initiatory": "",
	
	"baptism": "",
	
	"sealings":"",
	
    "templeClosures": "",
	
    "addlInformation" : [
      "To schedule an appointment for living ordinances (such as your own endowment, marriage, or sealing), please call the temple.",
      "To schedule a group visit, please call the temple.",
      "Ordinances for family names must be done in proper sequence—baptism, confirmation, Melchizedek Priesthood ordination (males), ",
	  "initiatory, endowment, and then sealing. Please allow sufficient time to perform all the ordinances you wish to complete during ",
	  "your visit. For additional help and information, please call the temple."
    ]
  } 
 ]
}